package com.platform.aix.service.user.inspection.enums;

/**
 * @description: key为双佳叶子节点字段名称 value为 inspectionindexname 映射
 * @author: fuyl
 * @create: 2020-08-20 20:09
 **/

public enum EnumSonka2ZxInspection {
    //===================================身高体重 Height ======================
    /**
     *身高
     */
    E00001("Height","身高"),
    /**
     * 体重
     */
    E00002("Weight","体重"),
    /**
     * BMI
     */
    E00003("BMI","BMI指数"),

    //===================================Fat 人体成分（脂肪） ======================
    E00004("FatRate","体脂率"),
    E00005("Viscera","内脏脂肪指数"),
    E00006("BasicMetabolism","基础代谢率"),
    E00007("MuscleRate","肌肉率"),
    E00008("WaterRate","水分率"),
    E00009("QuganMuscle","肌肉量"),
    E00010("Fic","细胞內液量"),
    E00011("Foc","细胞外液量"),
    E00012("Fat","脂肪量"),
    E00013("Water","水分量"),
    E00014("Protein","蛋白质"),
    E00015("Bmc","骨质量"),

    //===================================BloodPressure血压 ======================
    E00016("BloodPressure","血压"),
    E00017("Pulse","心率"),


    //===================================Bo血氧 ======================

    E00018("Oxygen","血氧"),
    E00019("Bpm","脉率"),

    //===================================Ecg单导心电 ======================


    E00020("Ecg","单导心电图"),

    //===================================PEEcg12导心电 ======================

    E00021("PEEcg","12导心电图"),

    //===================================Temperature体温 ======================

    E00022("Temperature","体温"),

    //===================================Whr腰臀比 ======================
    E00023("Waistline","腰围"),
    E00024("Whr","腰臀比"),

    //===================================BloodSugar血糖 ======================

    E00025("BloodSugar1","空腹血糖"),
    E00026("BloodSugar2","餐后2H血糖"),
    E00027("BloodSugar3","随机血糖"),

    //===================================Ua血尿酸 ======================

    E00028("Ua","尿酸(UA)"),

    //===================================Chol总胆固醇 ======================
    E00029("Chol","总胆固醇(TC)"),

    //===================================BloodFat血脂 ======================
    E00030("HdlChol","高密度脂蛋白(HDL)"),
    E00031("Trig","甘油三酯(TG)"),
    E00032("CalcLdl","低密度脂蛋白(LDL)"),

    //===================================Cardiovascular心血管 无此项目======================

    //===================================BMD骨密度 无此项目======================

    //===================================Hb血红蛋白======================
    E00033("Hb","血红蛋白(Hb)"),
    E00034("Hct","血细胞比容(HCT)"),

    //===================================Alcohol酒精浓度 无此项目======================

    //===================================Lung肺活量======================
    E00035("FVC","FVC"),
    E00036("FEV1","FEV1"),
    E00037("PEF","PEF"),

    //===================================MicAetery迈克大夫动脉硬化 无此项目======================

    //===================================Urinalysis尿液分析======================
    E00038("BLD","尿潜血"),
    E00039("KET","尿酮体"),
    E00040("PRO","尿蛋白"),
    E00041("MAL","尿微量白蛋白"),

    //===================================Vision视力筛查 无此项目=====================

    //===================================ArteryAve兆和动脉硬化 无此项目=====================

    //===================================宇峰动脉硬化Artery 无此项目=====================

    //===================================Ultrasound 超声（B超）=====================
    E00042("Ultrasound","其它B超"),

    ;

    private String key;
    private String value;

    public String getKey() {
        return key;
    }

    public void setKey(String key) {
        this.key = key;
    }

    public String getValue() {
        return value;
    }

    public void setValue(String value) {
        this.value = value;
    }

    private EnumSonka2ZxInspection(String key, String value) {
        this.key = key;
        this.value = value;

    }
}
